// A better way to view impossible travel alerts from MCAS :)
// Columns projected include, Time, Alert Name, User, MITRE, Alert Status, IPs associated, Cloud apps used, First (Standard) location, New location, the timeframe in which this happened
SecurityAlert
| where DisplayName =~ "Impossible Travel Activity"
| extend 
    ["IP Addresses"] = tostring(parse_json(ExtendedProperties).["IP Addresses"]),
    Countries = tostring(parse_json(ExtendedProperties).Countries)
| extend 
    ["Standard Location"] = trim_end(',.*?',Countries),
    ["New Location"] = trim_start('.*?,\\s',Countries),
    ["Impacted Applications"] = tostring(parse_json(ExtendedProperties).["Cloud Applications"]),
    Timeframe_p = trim_start('.*?within\\s',Description)
| extend Timeframe = trim_end('\\..*?',Timeframe_p)
| project TimeGenerated, tostring(DisplayName), tostring(CompromisedEntity), tostring(Tactics), tostring(Status), tostring(['IP Addresses']), ['Impacted Applications'], ['Standard Location'], ['New Location'], Timeframe
