// joins the tables EmailUrlInfo (URLs) to the full EmailEvents table on the common NetworkMessageId column
// very handy to add to / for investigating
EmailUrlInfo
| join EmailEvents on NetworkMessageId
//| where Url matches regex @'\w+\\.(\w{0-5}\w{0-5}?)'
//| where Url in~ (variableWatchlist)
// btw regex hasn't been tested, built it whilst putting this on GH
