//Cylaris TRG: QBot Obama#196/198, Heuristic CommandLine patterns
//ver 1.1
//TLP-GREEN
//falsepositive-rate:unlikely, HIGHLY accurate regex patterns // FOR OBAMA BELOW 200
//contact:extcomms@cylaris.org
//references: pr0xylife, MalwareBazaar, Ankit Anubhav
let qBot_IOC = dynamic(["197.164.182.46", "70.51.135.90", "187.251.132.144", "37.186.54.254", "80.11.74.81", "41.84.236.245", "24.139.72.117", "177.94.57.126", "37.34.253.233", 
"186.90.153.162", "32.221.224.140", "208.107.221.224", "67.165.206.193", "63.143.92.99", "88.232.220.207", "189.78.107.163", "74.14.5.179", "148.0.56.63", "40.134.246.185", 
"173.21.10.71", "124.40.244.115", "24.55.67.176", "39.44.164.54", "102.182.232.3", "39.49.101.104", "31.35.28.29", "120.150.218.241", "197.89.128.201", "31.48.174.63", 
"173.174.216.62", "67.209.195.198", "70.46.220.114", "24.178.196.158", "92.132.172.197", "179.158.105.44", "1.161.123.53", "91.177.173.10", "217.128.122.65", "144.202.3.39", 
"144.202.2.175", "45.76.167.26", "149.28.238.199", "140.82.63.183", "140.82.63.183", "45.63.1.12", "149.28.238.199", "45.76.167.26", "144.202.3.39", "144.202.2.175", "45.63.1.12", 
"109.12.111.14", "84.241.8.23", "104.34.212.7", "108.60.213.141", "117.248.109.38", "217.165.109.10", "82.152.39.39", "47.23.89.60", "176.67.56.94", "148.64.96.100", "76.70.9.169", 
"182.191.92.203", "37.210.170.123", "202.134.152.2", "89.101.97.139", "86.195.158.178", "140.82.49.12", "93.48.80.198", "187.207.131.50", "191.34.120.8", "37.208.135.172", 
"75.99.168.194", "5.32.41.45", "120.61.1.225", "101.51.77.238", "1.161.123.53", "86.97.9.190", "175.145.235.37", "39.44.235.10", "196.203.37.215", "41.38.167.179", "39.41.17.134", 
"58.105.167.36", "39.52.119.141", "76.25.142.196", "73.151.236.31", "96.37.113.36", "174.69.215.101", "201.142.177.168", "85.246.82.244", "201.145.165.25", "201.172.23.68", 
"72.252.157.93", "190.252.242.69", "45.46.53.140", "79.80.80.29", "72.252.157.93", "72.27.33.160", "72.252.157.93", "90.120.65.153", "201.103.141.2", "69.14.172.24", "31.215.185.26", 
"191.112.12.128", "189.253.206.105", "82.41.63.217", "208.101.82.0", "210.246.4.69", "83.110.92.106", "180.129.108.214", "47.157.227.70", "89.86.33.217", "177.156.191.231", 
"94.36.193.176", "217.164.121.161", "86.98.149.168", "103.207.85.38", "172.115.177.204", "105.27.172.6", "71.24.118.253", "143.0.219.6", "217.165.176.49", "5.203.199.157", 
"121.7.223.45", "47.156.131.10", "177.209.202.242", "41.86.42.158", "106.51.48.170", "41.84.229.240", "94.71.169.212", "111.125.245.116", "201.242.175.29", "38.70.253.226", 
"187.149.236.5", "217.165.79.88", "85.255.232.18", "103.246.242.202", "41.230.62.211", "38.70.253.226", "93.48.80.198", "31.215.185.136", "100.38.242.113", "47.23.89.60", 
"40.134.246.185", "89.101.97.139", "189.78.107.163", "69.14.172.24", "74.14.5.179", "37.34.253.233", "104.34.212.7", "80.11.74.81", "41.130.124.40", "24.43.99.75", "217.128.122.65", 
"70.46.220.114", "32.221.224.140", "81.214.215.234", "67.209.195.198", "94.59.15.180", "67.165.206.193", "173.174.216.62", "186.90.153.162", "148.64.96.100", "86.200.151.188", 
"1.161.81.21", "197.89.109.190", "41.228.22.180", "1.161.81.21", "129.208.0.52", "39.44.151.234", "172.115.177.204", "182.191.92.203", "84.241.8.23", "24.178.196.158", 
"117.248.109.38", "217.165.84.103", "31.215.98.8", "120.150.218.241", "39.52.24.107", "173.21.10.71", "174.69.215.101", "208.107.221.224", "184.97.29.26", "187.172.164.12", 
"76.25.142.196", "47.156.129.52", "190.252.242.69", "70.51.133.230", "72.252.157.93", "72.252.157.93", "177.45.18.42", "24.55.67.176", "24.139.72.117", "109.12.111.14", 
"72.252.157.93", "179.158.105.44", "45.46.53.140", "81.132.186.218", "63.143.92.99", "90.120.209.197", "102.65.62.206", "121.7.223.45", "67.69.166.79", "39.52.221.9", "196.203.37.215", 
"111.125.245.116", "39.41.10.170", "188.211.181.237", "39.49.125.183", "217.164.119.69", "193.136.1.58", "5.32.41.45", "162.252.222.118", "120.61.2.5", "201.172.20.167", 
"186.106.195.233", "101.50.67.7", "39.57.60.246", "210.246.4.69", "193.253.44.249", "71.13.93.154", "108.60.213.141", "2.34.12.8", "187.250.202.2", "94.36.193.176", "89.86.33.217", 
"31.215.67.68", "187.208.115.219", "191.250.120.152", "49.128.172.7", "91.177.173.10", "148.0.43.48", "68.204.15.28", "197.94.94.206", "87.109.229.215", "105.247.171.130", 
"81.250.191.49", "83.110.94.105", "201.176.6.24", "175.145.235.37", "41.84.249.56", "191.34.121.84", "113.53.152.11", "86.195.158.178", "109.228.220.196", "82.41.63.217", 
"82.152.39.39", "106.51.48.188", "103.246.242.202", "41.38.167.179", "98.50.153.207", "185.56.243.146", "47.157.227.70", "187.251.132.144", "31.35.28.29", "148.252.133.168", 
"60.15.135.155", "180.129.108.214", "138.186.28.253", "89.137.52.44", "122.118.129.227"]);
DeviceNetworkEvents | union DeviceProcessEvents
| where RemoteIP in~ (qBot_IOC) or (InitiatingProcessCommandLine matches regex @'(?i)(%windir%\\System32\\)?(")?cmd(\.exe)?(")\s\/c\sset\sr1=regs&&(%windir%|\w:\\Windows)\\system32\\curl\s-s\s-o\s(%temp%|\w:\\Users\\.*?\\AppData\\Local\\Temp)\\.*?\.(png|jpg|dll)\shttp(s)?:\/\/(www\.)?.*?\/.*?\.(jpg|dll|png)&&\scall.*?(%windir%|\w:\\windows)\\system32\\(regsvr32|%r1%vr32)\s.*?(%temp%|\w:\\Users\\.*?\\AppData\\Local\\Temp)\\.*?\.(png|dll|jpg)$'
or InitiatingProcessCommandLine matches regex @'(?i).*?cmd(\.exe)?\s\/c\s[a-z]:\\Users\\.*?\\AppData\\Local\\Temp\\.*?lnk.*?'
or InitiatingProcessCommandLine matches regex @'(?i).*?cmd\.exe.*?set\sr1=regs&&[a-z]:\\Windows\\System32\\curl\s-s\s-o.*?'
or InitiatingProcessCommandLine matches regex @'(?i).*?\\AppData\\Local\\Temp\\.*?\.png\shttp:\/\/.*?\.(jpg|dll|png).*?')
// Parse DLL URL from CommandLine
| extend qakbotPayload_URL = tolower(tostring(trim_start(@'(?i)%windir%.*?http(s)?:\/\/', InitiatingProcessCommandLine))) | extend qakbotPayload_URL = trim_end(@'&&call.*?', InitiatingProcessCommandLine)
